---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PointFailures.RegenFailure
source: html/7b06e78a-fe23-07d5-9377-727b336bd66e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PointFailures.RegenFailure Property

Regeneration Failure.

## Syntax (C#)
```csharp
public static FailureDefinitionId RegenFailure { get; }
```